PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_mipidsi.c
#define DSI_PHY_IF_CFG            (0xa4)
#define PHY_STOP_WAIT_TIME(cycle)    (((cycle) & 0xffUL) << 8)
#define N_LANES(n)            (((n) - 1UL) & 0x3UL)

#define DSI_PHY_ULPS_CTRL        0xa8
#define DSI_PHY_TX_TRIGGERS        0xac

#define DSI_PHY_STATUS            0xb0
#define PHY_STOP_STATE_CLK_LANE        BIT(2)
#define PHY_LOCK            BIT(0)

#define DSI_PHY_TST_CTRL0        0xb4
#define PHY_TESTCLK            BIT(1)
#define PHY_UNTESTCLK            0
#define PHY_TESTCLR            BIT(0)
#define PHY_UNTESTCLR            0

#define DSI_PHY_TST_CTRL1        0xb8
#define PHY_TESTEN            BIT(16)
#define PHY_UNTESTEN            0
#define PHY_TESTDOUT(n)            (((n) & 0xff) << 8)
#define PHY_TESTDIN(n)            ((n) & 0xff)

#define DSI_INT_ST0            0xbc
#define DSI_INT_ST1            0xc0
#define DSI_INT_MSK0            0xc4
#define DSI_INT_MSK1            0xc8

#define DSI_PHY_TMR_RD_CFG        0xf4
#define MAX_RD_TIME_V131(lbcc)        ((lbcc) & 0x7fff)

#define PHY_STATUS_TIMEOUT_US        10000
#define CMD_PKT_STATUS_TIMEOUT_US    20000
#define MIPI_FIFO_TIMEOUT_IN_MS      250
#define MIPI_DPHY_MAX_RETRIES        100U
#define MIPI_DPHY_STATUS_DATA_LINES  0x120UL
#define MIPI_DPHY_STATUS_DATA_LINE0  0x20UL

/*******************************************************************************
*                             Function Prototypes
*******************************************************************************/
void pll_reprogramming(cy_stc_mipidsi_config_t const *config);
void dphy_reg_write(uint16_t address, uint8_t data);

void dphy_reg_write(uint16_t address, uint8_t data)
{
    CY_SET_REG32(&GFXSS->GFXSS_MIPIDSI.DWCMIPIDSI.PHY_TST_CTRL1, PHY_TESTEN | 0x00UL);  //need to set msb of address in register 0x00
    CY_SET_REG32(&GFXSS->GFXSS_MIPIDSI.DWCMIPIDSI.PHY_TST_CTRL0, PHY_TESTCLK);
    CY_SET_REG32(&GFXSS->GFXSS_MIPIDSI.DWCMIPIDSI.PHY_TST_CTRL0, PHY_UNTESTCLR);

    CY_SET_REG32(&GFXSS->GFXSS_MIPIDSI.DWCMIPIDSI.PHY_TST_CTRL1, ((uint32_t)address >> 8UL));     //msb of address
    CY_SET_REG32(&GFXSS->GFXSS_MIPIDSI.DWCMIPIDSI.PHY_TST_CTRL0, PHY_TESTCLK);
    CY_SET_REG32(&GFXSS->GFXSS_MIPIDSI.DWCMIPIDSI.PHY_TST_CTRL0, PHY_UNTESTCLR);

    CY_SET_REG32(&GFXSS->GFXSS_MIPIDSI.DWCMIPIDSI.PHY_TST_CTRL1, PHY_TESTEN | (address & 0xFFUL));  //address of register
    CY_SET_REG32(&GFXSS->GFXSS_MIPIDSI.DWCMIPIDSI.PHY_TST_CTRL0, PHY_TESTCLK);
    CY_SET_REG32(&GFXSS->GFXSS_MIPIDSI.DWCMIPIDSI.PHY_TST_CTRL0, PHY_UNTESTCLR);

    CY_SET_REG32(&GFXSS->GFXSS_MIPIDSI.DWCMIPIDSI.PHY_TST_CTRL1, data);                 //data
    CY_SET_REG32(&GFXSS->GFXSS_MIPIDSI.DWCMIPIDSI.PHY_TST_CTRL0, PHY_TESTCLK);
    CY_SET_REG32(&GFXSS->GFXSS_MIPIDSI.DWCMIPIDSI.PHY_TST_CTRL0, PHY_UNTESTCLR);
}

void pll_reprogramming(cy_stc_mipidsi_config_t const *config)
{
    /* Round off to multiple of 50 Mbps */
    uint32_t bandwidth = (((config->per_lane_mbps + 25UL) / 50UL) * 50UL);

    /* Fixed settings for any bandwidth */
    dphy_reg_write(0x0001, 0x20); // DPHY reg 0x1, hsfreqrange_ovr_en_rw = 1'b1
    dphy_reg_write(0x015E, 0x10); // DPHY reg 0x15e: pll_cpbias_cntrl_rw[6:0]=0x10
    dphy_reg_write(0x0162, 0x08); // DPHY reg 0x162: pll_int_cntrl_rw=6'b000010, pll_gmp_cntrl_rw=2'b00
    dphy_reg_write(0x016E, 0x0A); // DPHY reg 0x16e: pll_prop_cntrl_wr[5:0]=6'b001010

    switch (bandwidth)
    {
    case 100U:
        dphy_reg_write(0x0002, 0x20); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0100000 (100Mbps)
        dphy_reg_write(0x017B, 0xFC); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x3E, pll_m_ovr_en_rw=1
        break;
    case 150U:
        dphy_reg_write(0x0002, 0x31); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0110001 (150Mbps)
        dphy_reg_write(0x017B, 0xF1); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x38, pll_m_ovr_en_rw=1
        break;
    case 200U:
        dphy_reg_write(0x0002, 0x03); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0000011 (200Mbps)
        dphy_reg_write(0x017B, 0xDD); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x2E, pll_m_ovr_en_rw=1
        break;
    case 250U:
        dphy_reg_write(0x0002, 0x33); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0110011 (250Mbps)
        dphy_reg_write(0x017B, 0xD1); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x28, pll_m_ovr_en_rw=1
        break;
    case 300U:
        dphy_reg_write(0x0002, 0x14); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0010100 (300Mbps)
        dphy_reg_write(0x017B, 0xD1); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x28, pll_m_ovr_en_rw=1
        break;
    case 350U:
        dphy_reg_write(0x0002, 0x35); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0110101 (350Mbps)
        dphy_reg_write(0x017B, 0xBD); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x1E, pll_m_ovr_en_rw=1
        break;
    case 400U:
        dphy_reg_write(0x0002, 0x05); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0000101 (400Mbps)
        dphy_reg_write(0x017B, 0xBD); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x1E, pll_m_ovr_en_rw=1
        break;
    case 450U:
        dphy_reg_write(0x0002, 0x16); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0010110 (450Mbps)
        dphy_reg_write(0x017B, 0xBD); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x1E, pll_m_ovr_en_rw=1
        break;
    case 500U:
        dphy_reg_write(0x0002, 0x26); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0100110 (500Mbps)
        dphy_reg_write(0x017B, 0xB1); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x18, pll_m_ovr_en_rw=1
        break;
    case 550U:
        dphy_reg_write(0x0002, 0x37); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0110111 (550Mbps)
        dphy_reg_write(0x017B, 0xBD); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x1E, pll_m_ovr_en_rw=1
        break;
    case 600U:
        dphy_reg_write(0x0002, 0x07); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0000111 (600Mbps)
        dphy_reg_write(0x017B, 0xBD); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x1E, pll_m_ovr_en_rw=1
        break;
    case 650U:
        dphy_reg_write(0x0002, 0x18); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0011000 (650Mbps)
        dphy_reg_write(0x017B, 0xBD); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x1E, pll_m_ovr_en_rw=1
        break;
    case 700U:
        dphy_reg_write(0x0002, 0x28); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0101000 (700Mbps)
        dphy_reg_write(0x017B, 0x9D); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0xE, pll_m_ovr_en_rw=1
        break;
    case 750U:
        dphy_reg_write(0x0002, 0x39); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0111001 (750Mbps)
        dphy_reg_write(0x017B, 0x9D); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0xE, pll_m_ovr_en_rw=1
        break;
    case 800U:
        dphy_reg_write(0x0002, 0x09); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0001001 (800Mbps)
        dphy_reg_write(0x017B, 0x9D); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0xE, pll_m_ovr_en_rw=1
        break;
    case 850U:
        dphy_reg_write(0x0002, 0x19); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0011001 (850Mbps)
        dphy_reg_write(0x017B, 0x91); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x8, pll_m_ovr_en_rw=1
        break;
    case 900U:
        dphy_reg_write(0x0002, 0x29); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0101001 (900Mbps)
        dphy_reg_write(0x017B, 0x91); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x8, pll_m_ovr_en_rw=1
        break;
    case 950U:
        dphy_reg_write(0x0002, 0x3A); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0111010 (950Mbps)
        dphy_reg_write(0x017B, 0x91); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x8, pll_m_ovr_en_rw=1
        break;
    case 1000U:
        dphy_reg_write(0x0002, 0x0A); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0001010 (1Gbps)
        dphy_reg_write(0x017B, 0x91); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x8, pll_m_ovr_en_rw=1
        break;
    case 1050U:
        dphy_reg_write(0x0002, 0x1A); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0011010 (1.05Gbps)
        dphy_reg_write(0x017B, 0x91); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x8, pll_m_ovr_en_rw=1
        break;
    case 1100U:
        dphy_reg_write(0x0002, 0x2A); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0101010 (1.1Gbps)
        dphy_reg_write(0x017B, 0x91); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x8, pll_m_ovr_en_rw=1
        break;
    case 1150U:
        dphy_reg_write(0x0002, 0x3B); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0111011 (1.15Gbps)
        dphy_reg_write(0x017B, 0x91); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x8, pll_m_ovr_en_rw=1
        break;
    case 1200U:
        dphy_reg_write(0x0002, 0x0B); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0001011 (1.2Gbps)
        dphy_reg_write(0x017B, 0x91); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x8, pll_m_ovr_en_rw=1
        break;
    case 1250U:
        dphy_reg_write(0x0002, 0x1B); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0011011 (1.25Gbps)
        dphy_reg_write(0x017B, 0x91); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x8, pll_m_ovr_en_rw=1
        break;
    case 1300U:
        dphy_reg_write(0x0002, 0x2B); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0101011 (1.3Gbps)
        dphy_reg_write(0x017B, 0x87); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x3, pll_m_ovr_en_rw=1
        break;
    case 1350U:
        dphy_reg_write(0x0002, 0x3C); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0111100 (1.35Gbps)
        dphy_reg_write(0x017B, 0x87); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x3, pll_m_ovr_en_rw=1
        break;
    case 1400U:
        dphy_reg_write(0x0002, 0x0C); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0001100 (1.4Gbps)
        dphy_reg_write(0x017B, 0x87); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x3, pll_m_ovr_en_rw=1
        break;
    case 1450U:
        dphy_reg_write(0x0002, 0x1C); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0011100 (1.45Gbps)
        dphy_reg_write(0x017B, 0x87); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x3, pll_m_ovr_en_rw=1
        break;
    default:
        dphy_reg_write(0x0002, 0x2C); // DPHY reg 0x2, hsfreqrange_ovr_rw    = 7'b0101100 (1.5Gbps)
        dphy_reg_write(0x017B, 0x87); // DPHY reg 0x17b: pll_vco_cntrl_ovr_en_rw=1, pll_vco_cntrl_ovr_rw=0x3, pll_m_ovr_en_rw=1
        break;
    }
}

static void cy_mipi_dsi_wr_tx_header(GFXSS_MIPIDSI_Type *mipi_dsi,
                                     uint8_t di, uint8_t data0, uint8_t data1)
{
    uint32_t reg;

    reg = ((uint32_t)data1 << 16) | ((uint32_t)data0 << 8) | (((uint32_t)di & 0x3fUL) << 0);

    mipi_dsi->DWCMIPIDSI.GEN_HDR = reg;
}

static void cy_mipi_dsi_wr_tx_data(GFXSS_MIPIDSI_Type *mipi_dsi,
                                   uint32_t tx_data)
{
    mipi_dsi->DWCMIPIDSI.GEN_PLD_DATA = tx_data;
}

