PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_mipidsi.c
static void cy_mipi_dsi_long_data_wr(GFXSS_MIPIDSI_Type *mipi_dsi,
                                     const uint8_t *data0, uint32_t data_size)
{
    uint32_t word_cnt = 0, payload = 0, no_of_words = 0, data_cnt = 0;

    no_of_words = data_size / 4U;
    /* in case that data count is more then 4 */
    for (word_cnt = 0; word_cnt < no_of_words; word_cnt++)
    {
        data_cnt = word_cnt * 4U;
        payload = (uint32_t)data0[data_cnt] |
                  (uint32_t)data0[data_cnt + 1U] << 8 |
                  (uint32_t)data0[data_cnt + 2U] << 16 |
                  (uint32_t)data0[data_cnt + 3U] << 24;

        cy_mipi_dsi_wr_tx_data(mipi_dsi, payload);
    }

    data_cnt = no_of_words * 4U;

    if ((data_size - data_cnt) < 4U)
    {
        if ((data_size - data_cnt) == 3U)
        {
            payload = (uint32_t)data0[data_cnt] |
                      (uint32_t)data0[data_cnt + 1U] << 8 |
                      (uint32_t)data0[data_cnt + 2U] << 16;
        }
        else if ((data_size - data_cnt) == 2U)
        {
            payload = (uint32_t)data0[data_cnt] |
                      (uint32_t)data0[data_cnt + 1U] << 8;
        }
        else if ((data_size - data_cnt) == 1U)
        {
            payload = (uint32_t)data0[data_cnt];
        }
        else
        {
            return; //nothing to write
        }

        cy_mipi_dsi_wr_tx_data(mipi_dsi, payload);
    }
}

static cy_en_mipidsi_status_t cy_mipi_dsi_pkt_write(GFXSS_MIPIDSI_Type *mipi_dsi,
        uint8_t data_type, const uint8_t *buf, uint32_t len)
{
    cy_en_mipidsi_status_t ret = CY_MIPIDSI_SUCCESS;
    const uint8_t *data = buf;

    if (mipi_dsi == NULL || buf == NULL)
    {
        ret = CY_MIPIDSI_BAD_PARAM;
    }

    if (ret == CY_MIPIDSI_SUCCESS)
    {
        if (len <= 2UL)
        {
            uint16_t user_data_short = 0;
            (void)memcpy((void*)&user_data_short, (void*)buf, (uint32_t)len);
            /* handle generic short write command */
            cy_mipi_dsi_wr_tx_header(mipi_dsi, data_type, (uint8_t)(user_data_short & 0xFFU), (uint8_t)(user_data_short >> 8));
        }
        else
        {
            /* handle generic long write command */
            /* Wait for FIFO to be Empty */
            while (((mipi_dsi->DWCMIPIDSI.CMD_PKT_STATUS & GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_BUFF_PLD_EMPTY_Msk) == 0UL) ||
                    ((mipi_dsi->DWCMIPIDSI.CMD_PKT_STATUS & GFXSS_MIPIDSI_DWCMIPIDSI_CMD_PKT_STATUS_CMD_PKT_STATUS_GEN_PLD_W_EMPTY_Msk) == 0UL)) {}

            cy_mipi_dsi_long_data_wr(mipi_dsi, data, len);

            cy_mipi_dsi_wr_tx_header(mipi_dsi, data_type, (uint8_t)len & 0xFFU,
                                     (uint8_t)((len & 0xFF00U) >> 8));
        }
    }

    return ret;
}

__STATIC_INLINE cy_en_mipidsi_status_t cy_mipi_dsi_dcs_cmd(GFXSS_MIPIDSI_Type *mipi_dsi,
        cy_en_mipidsi_dcs_cmd_type_t cmd, const uint32_t *param, int len)
{
    cy_en_mipidsi_status_t err = CY_MIPIDSI_SUCCESS;
    uint8_t buf[2];

    /* Unused until short write with parameter is implemented */
    (void)param;
    (void)len;

    switch (cmd)
    {
    case MIPI_DCS_EXIT_SLEEP_MODE:
    case MIPI_DCS_ENTER_SLEEP_MODE:
    case MIPI_DCS_SET_DISPLAY_ON:
    case MIPI_DCS_SET_DISPLAY_OFF:
    case MIPI_DCS_SOFT_RESET:
        buf[0] = (uint8_t)cmd;
        err = cy_mipi_dsi_pkt_write(mipi_dsi,
                                    (uint8_t)MIPI_DSI_DCS_SHORT_WRITE, buf, 1UL);
        break;

    default:
        err = CY_MIPIDSI_BAD_PARAM;
        break;
    }

    return err;
}
static void cy_mipi_dsi_clear_err(GFXSS_MIPIDSI_Type *mipi_dsi)
{
    mipi_dsi->DWCMIPIDSI.INT_ST0;
    mipi_dsi->DWCMIPIDSI.INT_ST1;

    mipi_dsi->DWCMIPIDSI.INT_MSK0 = 0xffffffffUL;
    mipi_dsi->DWCMIPIDSI.INT_MSK1 = 0xffffffffUL;
}

static void cy_mipi_dsi_dpi_config(GFXSS_MIPIDSI_Type *mipi_dsi,
                                   cy_stc_mipidsi_config_t const *config)
{
    uint32_t val = 0, color = 0;

    switch (config->dpi_fmt)
    {
    case CY_MIPIDSI_FMT_RGB888:
        color = DPI_COLOR_CODING_24BIT;
        break;
    case CY_MIPIDSI_FMT_RGB666:
        color = (uint32_t)DPI_COLOR_CODING_18BIT_2 | (uint32_t)LOOSELY18_EN;
        break;
    case CY_MIPIDSI_FMT_RGB666_PACKED:
        color = DPI_COLOR_CODING_18BIT_1;
        break;
    case CY_MIPIDSI_FMT_RGB565:
        color = DPI_COLOR_CODING_16BIT_1;
        break;
    default:
        //no action
        break;
    }

    if ((bool)(config->display_params->polarity_flags & DISPLAY_PARAMS_FLAG_NVSYNC))
    {
        val |= VSYNC_ACTIVE_LOW;
    }
    if ((bool)(config->display_params->polarity_flags & DISPLAY_PARAMS_FLAG_NHSYNC))
    {
        val |= HSYNC_ACTIVE_LOW;
    }

    mipi_dsi->DWCMIPIDSI.DPI_VCID = DPI_VCID(config->virtual_ch);
    mipi_dsi->DWCMIPIDSI.DPI_COLOR_CODING = color;
    mipi_dsi->DWCMIPIDSI.DPI_CFG_POL = val;

    mipi_dsi->DWCMIPIDSI.DPI_LP_CMD_TIM = OUTVACT_LPCMD_TIME(4UL) | INVACT_LPCMD_TIME(4UL);
}

static void cy_mipi_dsi_packet_handler_config(GFXSS_MIPIDSI_Type *mipi_dsi)
{
    /* Packet Configuration - Enable CRC, ECC, BTA*/
    mipi_dsi->DWCMIPIDSI.PCKHDL_CFG = CRC_RX_EN | ECC_RX_EN | BTA_EN;
}

static void cy_mipi_dsi_video_packet_config(GFXSS_MIPIDSI_Type *mipi_dsi,
        cy_stc_mipidsi_config_t const *config)
{
    mipi_dsi->DWCMIPIDSI.VID_PKT_SIZE = VID_PKT_SIZE(config->display_params->hdisplay);
}

static void cy_mipi_dsi_command_mode_config(GFXSS_MIPIDSI_Type *mipi_dsi)
{
    mipi_dsi->DWCMIPIDSI.TO_CNT_CFG = HSTX_TO_CNT(10000UL) | LPRX_TO_CNT(1000UL);
    mipi_dsi->DWCMIPIDSI.BTA_TO_CNT = 0xD00UL;
    mipi_dsi->DWCMIPIDSI.MODE_CFG = ENABLE_CMD_MODE;
}

/* Get lane byte clock cycles. */
static uint32_t cy_mipi_dsi_get_hcomponent_lbcc(cy_stc_mipidsi_config_t const *config,
        uint32_t hcomponent)
{
    uint32_t frac, lbcc;
    lbcc = hcomponent * config->per_lane_mbps * 1000UL / 8UL;

    frac = lbcc % config->display_params->pixel_clock;
    lbcc = lbcc / config->display_params->pixel_clock;
    if ((bool)frac)
    {
        lbcc++;
    }
    return lbcc;
}

static void cy_mipi_dsi_line_timer_config(GFXSS_MIPIDSI_Type *mipi_dsi,
        cy_stc_mipidsi_config_t const *config)
{
    uint32_t htotal, lbcc;

