PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_mipidsi.c
    htotal = (uint32_t)config->display_params->hsync_width + (uint32_t)config->display_params->hdisplay + (uint32_t)config->display_params->hfp + (uint32_t)config->display_params->hbp;

    lbcc = cy_mipi_dsi_get_hcomponent_lbcc(config, htotal);
    mipi_dsi->DWCMIPIDSI.VID_HLINE_TIME = lbcc;

    lbcc = cy_mipi_dsi_get_hcomponent_lbcc(config, config->display_params->hsync_width);
    mipi_dsi->DWCMIPIDSI.VID_HSA_TIME = lbcc;

    lbcc = cy_mipi_dsi_get_hcomponent_lbcc(config, config->display_params->hbp);
    mipi_dsi->DWCMIPIDSI.VID_HBP_TIME = lbcc;

}

static void cy_mipi_dsi_vertical_timing_config(GFXSS_MIPIDSI_Type *mipi_dsi,
        cy_stc_mipidsi_config_t const *config)
{

    if (mipi_dsi != NULL && config != NULL)
    {
        mipi_dsi->DWCMIPIDSI.VID_VACTIVE_LINES = config->display_params->vdisplay;
        mipi_dsi->DWCMIPIDSI.VID_VSA_LINES = config->display_params->vsync_width;
        mipi_dsi->DWCMIPIDSI.VID_VFP_LINES = config->display_params->vfp;
        mipi_dsi->DWCMIPIDSI.VID_VBP_LINES = config->display_params->vbp;
    }
}

static void cy_mipi_dsi_dphy_timing_config(GFXSS_MIPIDSI_Type *mipi_dsi)
{
    mipi_dsi->DWCMIPIDSI.PHY_TMR_CFG = PHY_CLKHS2LP_TIME(0x26UL) | PHY_CLKLP2HS_TIME(0x60UL);

    mipi_dsi->DWCMIPIDSI.PHY_TMR_LPCLK_CFG = PHY_CLKHS2LP_TIME(0x38UL) | PHY_CLKLP2HS_TIME(0x7DUL);
}

static void cy_mipi_dsi_dphy_interface_config(GFXSS_MIPIDSI_Type *mipi_dsi, cy_stc_mipidsi_config_t const *config)
{
    mipi_dsi->DWCMIPIDSI.PHY_IF_CFG = PHY_STOP_WAIT_TIME(0x28UL) | N_LANES(config->num_of_lanes);
}

static void cy_mipi_dsi_dphy_init(GFXSS_MIPIDSI_Type *mipi_dsi)
{
    cy_stc_syspm_miscldo_params_t ldo_params = {true, CY_SYSPM_MISCLDO_VCCACT, CY_SYSPM_MISCLDO_VOLTAGE_0_90V, CY_SYSPM_MISCLDO_VCCACT_TRIM_0};

    (void)Cy_SysPm_MiscLdoConfigure(&ldo_params);

    /* Clear PHY state */
    mipi_dsi->DWCMIPIDSI.PHY_RSTZ = PHY_DISFORCEPLL | PHY_DISABLECLK | DPHY_RSTZ | PHY_SHUTDOWNZ;
    mipi_dsi->DWCMIPIDSI.PHY_TST_CTRL0 = PHY_UNTESTCLR;
    mipi_dsi->DWCMIPIDSI.PHY_TST_CTRL0 = PHY_TESTCLR;
    mipi_dsi->DWCMIPIDSI.PHY_TST_CTRL0 = PHY_UNTESTCLR;
}

static void cy_mipi_dsi_dphy_enable(GFXSS_MIPIDSI_Type *mipi_dsi)
{
    mipi_dsi->DWCMIPIDSI.PHY_RSTZ = 0;
    mipi_dsi->DWCMIPIDSI.PHY_RSTZ = PHY_ENABLECLK;
    mipi_dsi->DWCMIPIDSI.PHY_RSTZ = PHY_ENABLECLK | PHY_UNSHUTDOWNZ;
    mipi_dsi->DWCMIPIDSI.PHY_RSTZ = PHY_ENABLECLK | PHY_UNRSTZ | PHY_UNSHUTDOWNZ;

    while ((CY_GET_REG32(&GFXSS->GFXSS_MIPIDSI.DWCMIPIDSI.PHY_STATUS) & (PHY_LOCK)) != (PHY_LOCK))
    {
        Cy_SysLib_DelayUs(10);
    }
}

static void cy_mipi_dsi_init(GFXSS_MIPIDSI_Type *base, cy_stc_mipidsi_config_t const *config)
{
    /*
     * The maximum permitted escape clock is 20MHz and it is derived from
     * lanebyteclk, which is running at "max_phy_clk / 8".  Thus we want:
     *
     *     (max_phy_clk >> 3) / esc_clk_division < 20
     * which is:
     *     (max_phy_clk >> 3) / 20 > esc_clk_division
     */
    uint32_t esc_clk_division = (config->max_phy_clk >> 3) / 20UL + 1UL;


    /* RESET MIPI DSI IP Block */
    base->DWCMIPIDSI.PWR_UP = ~_VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_PWR_UP_PWR_UP_SHUTDOWNZ, 1);

    /* Configure Clock */
    base->DWCMIPIDSI.CLKMGR_CFG = TO_CLK_DIVISION(10UL) | TX_ESC_CLK_DIVISION(esc_clk_division);

}
static void cy_mipi_dsi_video_mode_config(GFXSS_MIPIDSI_Type *base, cy_stc_mipidsi_config_t const *config)
{
    base->DWCMIPIDSI.VID_MODE_CFG =  config->mode_flags;
}

static void cy_mipi_dsi_set_mode(GFXSS_MIPIDSI_Type *base, cy_stc_mipidsi_config_t const *config)
{
    /* RESET MIPI DSI IP Block */
    base->DWCMIPIDSI.PWR_UP &= ~_VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_PWR_UP_PWR_UP_SHUTDOWNZ, 1);

    if (config->dsi_mode == DSI_VIDEO_MODE)
    {
        base->DWCMIPIDSI.MODE_CFG = ENABLE_VIDEO_MODE;
    }
    else
    {
        base->DWCMIPIDSI.MODE_CFG = ENABLE_CMD_MODE;
    }

    base->DWCMIPIDSI.LPCLK_CTRL = PHY_TXREQUESTCLKHS ;
    /* powerup MIPI DSI IP Block */
    base->DWCMIPIDSI.PWR_UP |= _VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_PWR_UP_PWR_UP_SHUTDOWNZ, 1);
}

cy_en_mipidsi_status_t Cy_MIPIDSI_Init(GFXSS_MIPIDSI_Type *base, cy_stc_mipidsi_config_t const *config, cy_stc_mipidsi_context_t *context)
{
    cy_en_mipidsi_status_t result = CY_MIPIDSI_SUCCESS;

    CY_ASSERT_L1(NULL != base);

    (void)context;

    /* Power up DSI and DPHY */
    cy_mipi_dsi_init(base, config);

    /* DSI Display Interface Configuration */
    cy_mipi_dsi_dpi_config(base, config);

    cy_mipi_dsi_packet_handler_config(base);
    cy_mipi_dsi_video_mode_config(base, config);
    cy_mipi_dsi_video_packet_config(base, config);
    cy_mipi_dsi_command_mode_config(base);
    cy_mipi_dsi_line_timer_config(base, config);
    cy_mipi_dsi_vertical_timing_config(base, config);

    cy_mipi_dsi_dphy_init(base);
    cy_mipi_dsi_dphy_timing_config(base);
    cy_mipi_dsi_dphy_interface_config(base, config);

    cy_mipi_dsi_clear_err(base);
    pll_reprogramming(config);
    cy_mipi_dsi_dphy_enable(base);

    cy_mipi_dsi_set_mode(base, config);

    /* Clear Error Status */
    cy_mipi_dsi_clear_err(base);

    return result;
}

void Cy_MIPIDSI_Enable(GFXSS_MIPIDSI_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    base->MXMIPIDSI.CTL |= GFXSS_MIPIDSI_MXMIPIDSI_CTL_ENABLED_Msk;
}

void Cy_MIPIDSI_Disable(GFXSS_MIPIDSI_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    base->MXMIPIDSI.CTL &= ~GFXSS_MIPIDSI_MXMIPIDSI_CTL_ENABLED_Msk;
}

void Cy_MIPIDSI_DeInit(GFXSS_MIPIDSI_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    /* Power down DPHY */
    base->DWCMIPIDSI.PHY_RSTZ = 0;
}

void  Cy_MIPIDSI_SetInterruptMask(GFXSS_MIPIDSI_Type *base, uint32_t interrupt_mask)
{
    CY_ASSERT_L1(NULL != base);

    base->MXMIPIDSI.INTR_MASK = interrupt_mask;
}

uint32_t  Cy_MIPIDSI_GetInterruptMask(GFXSS_MIPIDSI_Type const *base)
{
    CY_ASSERT_L1(NULL != base);

    return base->MXMIPIDSI.INTR_MASK;
}

uint32_t  Cy_MIPIDSI_GetInterruptStatusMasked(GFXSS_MIPIDSI_Type const *base)
{
    CY_ASSERT_L1(NULL != base);

