PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_mipidsi.c
    return base->MXMIPIDSI.INTR_MASKED;
}

cy_en_mipidsi_status_t Cy_MIPIDSI_WritePacket(GFXSS_MIPIDSI_Type *base, const uint8_t *buf, uint32_t length)
{
    cy_en_mipidsi_packet_type_t packet_type;

    CY_ASSERT_L1(NULL != base);


    if (0UL == length)
    {
        return CY_MIPIDSI_BAD_PARAM;
    }
    else if (1UL == length)
    {
        packet_type = MIPI_DSI_DCS_SHORT_WRITE;
    }
    else if (2UL == length)
    {
        packet_type = MIPI_DSI_DCS_SHORT_WRITE_PARAM;
    }
    else
    {
        packet_type = MIPI_DSI_DCS_LONG_WRITE;
    }

    return cy_mipi_dsi_pkt_write(base, (uint8_t)packet_type, buf, length);
}

cy_en_mipidsi_status_t Cy_MIPIDSI_GenericWritePacket(GFXSS_MIPIDSI_Type *base, const uint8_t *buf, uint32_t length)
{
    cy_en_mipidsi_packet_type_t packet_type;

    CY_ASSERT_L1(NULL != base);


    if (0UL == length)
    {
        return CY_MIPIDSI_BAD_PARAM;
    }
    else if (1UL == length)
    {
        packet_type = MIPI_DSI_GENERIC_SHORT_WRITE_0_PARAM;
    }
    else if (2UL == length)
    {
        packet_type = MIPI_DSI_GENERIC_SHORT_WRITE_1_PARAM;
    }
    else if (3UL == length)
    {
        packet_type = MIPI_DSI_GENERIC_SHORT_WRITE_2_PARAM;
    }
    else
    {
        packet_type = MIPI_DSI_GENERIC_LONG_WRITE;
    }

    return cy_mipi_dsi_pkt_write(base, (uint8_t)packet_type, buf, length);
}

cy_en_mipidsi_status_t Cy_MIPIDSI_ReadPacket(GFXSS_MIPIDSI_Type *base, cy_en_mipidsi_packet_type_t packet_type, uint32_t *buf, uint32_t length)
{
    /* To be implemented - As per SAS DSI Read is not supported yet. Need to implement this using Generic APB Slave interface */

    (void)base;
    (void)packet_type;
    (void)buf;
    (void)length;

    return CY_MIPIDSI_SUCCESS;
}

cy_en_mipidsi_status_t Cy_MIPIDSI_EnterSleep(GFXSS_MIPIDSI_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    cy_en_mipidsi_status_t result =  cy_mipi_dsi_dcs_cmd(base, MIPI_DCS_ENTER_SLEEP_MODE, NULL, 0);
    return result;
}

cy_en_mipidsi_status_t Cy_MIPIDSI_ExitSleep(GFXSS_MIPIDSI_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    cy_en_mipidsi_status_t result =  cy_mipi_dsi_dcs_cmd(base, MIPI_DCS_EXIT_SLEEP_MODE, NULL, 0);
    if (result == CY_MIPIDSI_SUCCESS)
    {
        //do nothing
    }
    else
    {
        //do nothing
    }
    return result;
}

cy_en_mipidsi_status_t Cy_MIPIDSI_SoftReset(GFXSS_MIPIDSI_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    cy_en_mipidsi_status_t result =  cy_mipi_dsi_dcs_cmd(base, MIPI_DCS_SOFT_RESET, NULL, 0);
    return result;
}

cy_en_mipidsi_status_t Cy_MIPIDSI_DisplayON(GFXSS_MIPIDSI_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    cy_en_mipidsi_status_t result =  cy_mipi_dsi_dcs_cmd(base, MIPI_DCS_SET_DISPLAY_ON, NULL, 0);
    return result;
}

cy_en_mipidsi_status_t Cy_MIPIDSI_DisplayOFF(GFXSS_MIPIDSI_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    cy_en_mipidsi_status_t result =  cy_mipi_dsi_dcs_cmd(base, MIPI_DCS_SET_DISPLAY_OFF, NULL, 0);
    return result;
}

cy_en_mipidsi_status_t Cy_MIPIDSI_EnterULPM(GFXSS_MIPIDSI_Type *base)
{
    cy_en_mipidsi_status_t status = CY_MIPIDSI_TIMEOUT;
    uint32_t no_of_lanes = _FLD2VAL(GFXSS_MIPIDSI_DWCMIPIDSI_PHY_IF_CFG_PHY_IF_CFG_N_LANES, base->DWCMIPIDSI.PHY_IF_CFG);

    /*  Set PHY_ULPS_CTRL[3:0] = 4'h5 to enter ULPM in the data and clock lanes. */
    base->DWCMIPIDSI.PHY_ULPS_CTRL = _VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_PHY_ULPS_CTRL_PHY_ULPS_CTRL_PHY_TXREQULPSCLK, 1) |
                                     _VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_PHY_ULPS_CTRL_PHY_ULPS_CTRL_PHY_TXREQULPSLAN, 1);
    Cy_SysLib_Delay(1);
    /*  Verify that all the data lanes has entered in ULPM using PHY_STATUS register. */
    if (no_of_lanes == N_LANES(2UL)) //Two lanes configured
    {
        if ((base->DWCMIPIDSI.PHY_STATUS & MIPI_DPHY_STATUS_DATA_LINES) == 0x0U)
        {
            status = CY_MIPIDSI_SUCCESS;
        }
    }
    else                           //one lane configured
    {
        if ((base->DWCMIPIDSI.PHY_STATUS & MIPI_DPHY_STATUS_DATA_LINE0) == 0x0U)
        {
            status = CY_MIPIDSI_SUCCESS;
        }
    }

    base->DWCMIPIDSI.PWR_UP &=  ~_VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_PWR_UP_PWR_UP_SHUTDOWNZ, 1);

    return status;
}
cy_en_mipidsi_status_t Cy_MIPIDSI_ExitULPM(GFXSS_MIPIDSI_Type *base)
{
    cy_en_mipidsi_status_t status = CY_MIPIDSI_TIMEOUT;
    uint32_t no_of_lanes = _FLD2VAL(GFXSS_MIPIDSI_DWCMIPIDSI_PHY_IF_CFG_PHY_IF_CFG_N_LANES, base->DWCMIPIDSI.PHY_IF_CFG);

    base->DWCMIPIDSI.PWR_UP |= _VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_PWR_UP_PWR_UP_SHUTDOWNZ, 1);

    /* Exit ULPM Data and Clock lines */
    base->DWCMIPIDSI.PHY_ULPS_CTRL = _VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_PHY_ULPS_CTRL_PHY_ULPS_CTRL_PHY_TXEXITULPSLAN, 1) |
                                     _VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_PHY_ULPS_CTRL_PHY_ULPS_CTRL_PHY_TXEXITULPSCLK, 1);

    Cy_SysLib_Delay(1);
    /*  Verify that all the data lanes has exited in ULPM using PHY_STATUS register. */
    if (no_of_lanes == N_LANES(2UL)) //Two lanes configured
    {
        if ((base->DWCMIPIDSI.PHY_STATUS & MIPI_DPHY_STATUS_DATA_LINES) == MIPI_DPHY_STATUS_DATA_LINES)
        {
            status = CY_MIPIDSI_SUCCESS;
        }
    }
    else                          //one lane configured
    {
        if ((base->DWCMIPIDSI.PHY_STATUS & MIPI_DPHY_STATUS_DATA_LINE0) == MIPI_DPHY_STATUS_DATA_LINE0)
        {
            status = CY_MIPIDSI_SUCCESS;
        }
    }

    return status;
}
cy_en_mipidsi_status_t Cy_MIPIDSI_EnterULPM_Data(GFXSS_MIPIDSI_Type *base)
{
    cy_en_mipidsi_status_t status = CY_MIPIDSI_TIMEOUT;
    uint32_t no_of_lanes = _FLD2VAL(GFXSS_MIPIDSI_DWCMIPIDSI_PHY_IF_CFG_PHY_IF_CFG_N_LANES, base->DWCMIPIDSI.PHY_IF_CFG);

    /*  Set PHY_ULPS_CTRL[3:0] = 0x4 to enter ULPM in the data lanes. */
    base->DWCMIPIDSI.PHY_ULPS_CTRL = _VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_PHY_ULPS_CTRL_PHY_ULPS_CTRL_PHY_TXREQULPSLAN, 1);
    Cy_SysLib_Delay(1);
    /*  Verify that all the data lanes has entered in ULPM using PHY_STATUS register. */
    if (no_of_lanes == N_LANES(2UL)) //Two lanes configured
    {
        if ((base->DWCMIPIDSI.PHY_STATUS & MIPI_DPHY_STATUS_DATA_LINES) == 0x0U)
        {
            status = CY_MIPIDSI_SUCCESS;
        }
    }
    else                          //one lane configured
    {
        if ((base->DWCMIPIDSI.PHY_STATUS & MIPI_DPHY_STATUS_DATA_LINE0) == 0x0U)
        {
            status = CY_MIPIDSI_SUCCESS;
        }
    }

    base->DWCMIPIDSI.PWR_UP &=  ~_VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_PWR_UP_PWR_UP_SHUTDOWNZ, 1);

    return status;

}
cy_en_mipidsi_status_t Cy_MIPIDSI_ExitULPM_Data(GFXSS_MIPIDSI_Type *base)
{
    cy_en_mipidsi_status_t status = CY_MIPIDSI_TIMEOUT;
    uint32_t no_of_lanes = (uint8_t)_FLD2VAL(GFXSS_MIPIDSI_DWCMIPIDSI_PHY_IF_CFG_PHY_IF_CFG_N_LANES, base->DWCMIPIDSI.PHY_IF_CFG);

    base->DWCMIPIDSI.PWR_UP |= _VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_PWR_UP_PWR_UP_SHUTDOWNZ, 1);

    /* Assert the Exit ULPM bits by setting PHY_ULPS_CTRL[3:0] = 0x8 */
    base->DWCMIPIDSI.PHY_ULPS_CTRL = _VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_PHY_ULPS_CTRL_PHY_ULPS_CTRL_PHY_TXEXITULPSLAN, 1);;
    Cy_SysLib_Delay(1);
    /*  Verify that all the data lanes has exited in ULPM using PHY_STATUS register. */
    if (no_of_lanes == N_LANES(2UL)) //Two lanes configured
    {
        if ((base->DWCMIPIDSI.PHY_STATUS & MIPI_DPHY_STATUS_DATA_LINES) == MIPI_DPHY_STATUS_DATA_LINES)
        {
            status = CY_MIPIDSI_SUCCESS;
        }
    }
    else                           //one lane configured
    {
        if ((base->DWCMIPIDSI.PHY_STATUS & MIPI_DPHY_STATUS_DATA_LINE0) == MIPI_DPHY_STATUS_DATA_LINE0)
        {
            status = CY_MIPIDSI_SUCCESS;
        }
    }

    return status;
}

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS22GFXSS */
/* [] END OF FILE */
